tap "databricks/tap"
tap "homebrew/bundle"
brew "aircrack-ng"
brew "autoconf"
brew "automake"
brew "biome"
brew "ccache"
brew "chezmoi"
brew "clang-format"
brew "cliclick"
brew "cmake"
brew "cowsay"
brew "dfu-util"
brew "docker"
brew "duckdb"
brew "figlet"
brew "libtool"
brew "gh"
brew "gitleaks"
brew "jq"
brew "just"
brew "libmagic"
brew "mise"
brew "ncdu"
brew "ninja"
brew "nushell"
brew "openjdk"
brew "openjdk@17"
brew "postgis"
brew "postgresql@14"
brew "pure"
brew "python@3.12"
brew "starship"
brew "ta-lib"
brew "terraform"
brew "thefuck"
brew "tmux"
brew "tree"
brew "uv"
brew "yq"
brew "zig"
brew "databricks/tap/databricks"
cask "1password"
cask "bruno"
cask "claude-code"
cask "cleanupbuddy"
cask "cursor"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "firefox"
cask "floorp"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "kitty"
cask "linear-linear"
cask "min"
cask "miro"
cask "mqttx"
cask "neat"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "qutebrowser"
cask "raycast"
cask "slack"
cask "stats"
cask "sublime-text"
cask "visual-studio-code"
cask "zen-privacy"
cask "zoom"
vscode "albert.tabout"
vscode "anysphere.cpptools"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-ssh"
vscode "biomejs.biome"
vscode "blueglassblock.better-json5"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "detachhead.basedpyright"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "espressif.esp-idf-extension"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.makefile-tools"
vscode "nefrob.vscode-just-syntax"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
