tap "databricks/tap"
brew "biome"
brew "chezmoi"
brew "cowsay"
brew "duckdb"
brew "figlet"
brew "gitleaks"
brew "just"
brew "libmagic"
brew "openjdk@17"
brew "postgis"
brew "postgresql@14"
brew "pure"
brew "python@3.12"
brew "terraform"
brew "tree"
brew "uv"
brew "databricks/tap/databricks"
cask "1password"
cask "bruno"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "floorp"
cask "font-fira-code"
cask "google-chrome"
cask "iterm2"
cask "linear-linear"
cask "min"
cask "miro"
cask "neat"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "postman"
cask "raycast"
cask "slack"
cask "stats"
cask "zen-privacy"
cask "zoom"
vscode "albert.tabout"
vscode "anysphere.cursorpyright"
vscode "biomejs.biome"
vscode "blueglassblock.better-json5"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "detachhead.basedpyright"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "nefrob.vscode-just-syntax"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
