albert.tabout
anysphere.cursorpyright
biomejs.biome
blueglassblock.better-json5
bradlc.vscode-tailwindcss
charliermarsh.ruff
davidanson.vscode-markdownlint
detachhead.basedpyright
eamodio.gitlens
esbenp.prettier-vscode
gruntfuggly.todo-tree
hashicorp.terraform
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
nefrob.vscode-just-syntax
redhat.vscode-xml
redhat.vscode-yaml
rust-lang.rust-analyzer
vscodevim.vim
yoavbls.pretty-ts-errors
